Revit 2027 API
DividedSurface.CanBeIntersectionElement Method
 Checks if the element can be an intersection reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanBeIntersectionElement(
	ElementId id
)
Public Function CanBeIntersectionElement (
	id As ElementId
) As Boolean
public:
bool CanBeIntersectionElement(
	ElementId^ id
)
member CanBeIntersectionElement :
        id : ElementId -> bool
Parameters
id ElementId
 The element to be checked.
Return Value
Boolean
 True if the element can be an intersection reference., false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The element must be a level, grid, reference plane, or a curve element whose category is lines and reference lines.
See Also
Reference
DividedSurface Class
Autodesk.Revit.DB Namespace